# Задание №1
# Сначала вводится число N, затем вводится ровно N целых чисел. Подсчитайте, сколько из них равны нулю, и выведите это количество


n = int(input())
cnt = 0
for i in range(1, n+1):
    a = int(input())
    if a == 0:
        cnt += 1   
print(cnt)






    



    








